weather_data_emailer/app/Controllers/Weather.php

SELECT *
FROM `users`
WHERE `users`.`id` = '2'
---
    public function getDetails()
    {
        if ($this->request->getMethod() == 'post') {
            $location = $this->request->getPost('location');


            if (!session()->get('isLoggedIn')) {
                return $this->response->setJSON(['error_message' => 'You must be logged in to view weather data.']);
            }


            $userId = session()->get('id');
            $userModel = new UserModel();
            $userExists = $userModel->find($userId);